#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.secret: Reading...
data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
data.aws_secretsmanager_secret_version.current: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.thomaskimble_certificate will be created
  + resource "aws_acm_certificate" "thomaskimble_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "thomaskimble.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.thomaskimble.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "thomaskimble.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.thomaskimble.com",
          + "thomaskimble.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.thomaskimble_certificate_validation will be created
  + resource "aws_acm_certificate_validation" "thomaskimble_certificate_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_amplify_app.thomaskimble_frontend will be created
  + resource "aws_amplify_app" "thomaskimble_frontend" {
      + access_token                = (sensitive value)
      + arn                         = (known after apply)
      + build_spec                  = <<-EOT
            version: 0.1
            frontend:
              phases:
                preBuild:
                    commands:
                      - npm ci
                build:
                    commands:
                      - npm run build
              artifacts:
                baseDirectory: build
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      + custom_headers              = (known after apply)
      + default_domain              = (known after apply)
      + enable_branch_auto_build    = true
      + enable_branch_auto_deletion = true
      + environment_variables       = {
          + "_CUSTOM_IMAGE" = "amplify:al2"
        }
      + id                          = (known after apply)
      + name                        = "thomaskimble-frontend"
      + platform                    = "WEB"
      + production_branch           = (known after apply)
      + repository                  = "https://github.com/ThomasOliverKimble/thomaskimble-frontend"
      + tags_all                    = (known after apply)

      + custom_rule {
          + source = "</^[^.]+$|\\.(?!(css|gif|ico|jpg|js|png|txt|svg|woff|ttf|map|json)$)([^.]+$)/>"
          + status = "200"
          + target = "/index.html"
        }
      + custom_rule {
          + source = "http://thomaskimble.com"
          + status = "302"
          + target = "http://www.thomaskimble.com"
        }
    }

  # aws_amplify_branch.dev will be created
  + resource "aws_amplify_branch" "dev" {
      + app_id               = (known after apply)
      + arn                  = (known after apply)
      + associated_resources = (known after apply)
      + branch_name          = "dev"
      + custom_domains       = (known after apply)
      + destination_branch   = (known after apply)
      + display_name         = (known after apply)
      + enable_auto_build    = true
      + framework            = "React"
      + id                   = (known after apply)
      + source_branch        = (known after apply)
      + stage                = "DEVELOPMENT"
      + tags_all             = (known after apply)
    }

  # aws_amplify_branch.main will be created
  + resource "aws_amplify_branch" "main" {
      + app_id               = (known after apply)
      + arn                  = (known after apply)
      + associated_resources = (known after apply)
      + branch_name          = "main"
      + custom_domains       = (known after apply)
      + destination_branch   = (known after apply)
      + display_name         = (known after apply)
      + enable_auto_build    = true
      + framework            = "React"
      + id                   = (known after apply)
      + source_branch        = (known after apply)
      + stage                = "PRODUCTION"
      + tags_all             = (known after apply)
    }

  # aws_amplify_domain_association.thomaskimble will be created
  + resource "aws_amplify_domain_association" "thomaskimble" {
      + app_id                              = (known after apply)
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "thomaskimble.com"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "dev"
          + dns_record  = (known after apply)
          + prefix      = "dev"
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_route53_record.thomaskimble_records["*.thomaskimble.com"] will be created
  + resource "aws_route53_record" "thomaskimble_records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.thomaskimble_records["thomaskimble.com"] will be created
  + resource "aws_route53_record" "thomaskimble_records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.thomaskimble_zone will be created
  + resource "aws_route53_zone" "thomaskimble_zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "thomaskimble.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*